Oryx-Embedded/CycloneTCP/drivers/mac/s32k344_eth_driver.c
/**
 * @file s32k344_eth_driver.c
 * @brief NXP S32K344 Ethernet MAC driver
 *
 * @section License
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 *
 * Copyright (C) 2010-2026 Oryx Embedded SARL. All rights reserved.
 *
 * This file is part of CycloneTCP Open.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software Foundation,
 * Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
 *
 * @author Oryx Embedded SARL (www.oryx-embedded.com)
 * @version 2.6.2
 **/

//Switch to the appropriate trace level
#define TRACE_LEVEL NIC_TRACE_LEVEL

//Dependencies
#include "S32K344.h"
#include "core/net.h"
#include "drivers/mac/s32k344_eth_driver.h"
#include "debug.h"

//Underlying network interface
static NetInterface *nicDriverInterface;

//IAR EWARM compiler?
#if defined(__ICCARM__)

//Transmit buffer
#pragma data_alignment = 4
#pragma location = S32K344_ETH_RAM_SECTION
static uint8_t txBuffer[S32K344_ETH_TX_BUFFER_COUNT][S32K344_ETH_TX_BUFFER_SIZE];
//Receive buffer
#pragma data_alignment = 4
#pragma location = S32K344_ETH_RAM_SECTION
static uint8_t rxBuffer[S32K344_ETH_RX_BUFFER_COUNT][S32K344_ETH_RX_BUFFER_SIZE];
//Transmit DMA descriptors
#pragma data_alignment = 4
#pragma location = S32K344_ETH_RAM_SECTION
static S32k344TxDmaDesc txDmaDesc[S32K344_ETH_TX_BUFFER_COUNT];
//Receive DMA descriptors
#pragma data_alignment = 4
#pragma location = S32K344_ETH_RAM_SECTION
static S32k344RxDmaDesc rxDmaDesc[S32K344_ETH_RX_BUFFER_COUNT];

//Keil MDK-ARM or GCC compiler?
#else

//Transmit buffer
static uint8_t txBuffer[S32K344_ETH_TX_BUFFER_COUNT][S32K344_ETH_TX_BUFFER_SIZE]
   __attribute__((aligned(4), __section__(S32K344_ETH_RAM_SECTION)));
//Receive buffer
static uint8_t rxBuffer[S32K344_ETH_RX_BUFFER_COUNT][S32K344_ETH_RX_BUFFER_SIZE]
   __attribute__((aligned(4), __section__(S32K344_ETH_RAM_SECTION)));
//Transmit DMA descriptors
static S32k344TxDmaDesc txDmaDesc[S32K344_ETH_TX_BUFFER_COUNT]
   __attribute__((aligned(4), __section__(S32K344_ETH_RAM_SECTION)));
//Receive DMA descriptors
static S32k344RxDmaDesc rxDmaDesc[S32K344_ETH_RX_BUFFER_COUNT]
   __attribute__((aligned(4), __section__(S32K344_ETH_RAM_SECTION)));

#endif

//Current transmit descriptor
static uint_t txIndex;
//Current receive descriptor
static uint_t rxIndex;


/**
 * @brief S32K344 Ethernet MAC driver
 **/

const NicDriver s32k344EthDriver =
{
   NIC_TYPE_ETHERNET,
   ETH_MTU,
   s32k344EthInit,
   s32k344EthTick,
   s32k344EthEnableIrq,
   s32k344EthDisableIrq,
   s32k344EthEventHandler,
   s32k344EthSendPacket,
   s32k344EthUpdateMacAddrFilter,
   s32k344EthUpdateMacConfig,
   s32k344EthWritePhyReg,
   s32k344EthReadPhyReg,
   TRUE,
   TRUE,
   TRUE,
   FALSE
};


/**
 * @brief S32K344 Ethernet MAC initialization
 * @param[in] interface Underlying network interface
 * @return Error code
 **/

error_t s32k344EthInit(NetInterface *interface)
{
   error_t error;
   uint32_t temp;

   //Debug message
   TRACE_INFO("Initializing S32K344 Ethernet MAC...\r\n");

   //Save underlying network interface
   nicDriverInterface = interface;

   //GPIO configuration
   s32k344EthInitGpio(interface);

   //Enable EMAC clock
   IP_MC_ME->PRTN2_COFB1_CLKEN |= MC_ME_PRTN2_COFB1_CLKEN_REQ32_MASK;
   IP_MC_ME->PRTN2_PCONF |= MC_ME_PRTN2_PCONF_PCE_MASK;
   IP_MC_ME->PRTN2_PUPD |= MC_ME_PRTN2_PUPD_PCUD_MASK;
   IP_MC_ME->CTL_KEY = MC_ME_CTL_KEY_KEY(0x5AF0);
   IP_MC_ME->CTL_KEY = MC_ME_CTL_KEY_KEY(0xA50F);

   //Wait for the hardware update process to complete
   while((IP_MC_ME->PRTN2_PUPD & MC_ME_PRTN2_PUPD_PCUD_MASK) != 0)
   {
   }

   //Perform a software reset
   IP_EMAC->DMA_MODE |= EMAC_DMA_MODE_SWR_MASK;
   //Wait for the reset to complete
   while((IP_EMAC->DMA_MODE & EMAC_DMA_MODE_SWR_MASK) != 0)
   {
   }

   //Adjust MDC clock range depending on CSR frequency
   IP_EMAC->MAC_MDIO_ADDRESS = EMAC_MAC_MDIO_ADDRESS_CR(4);

   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Ethernet PHY initialization
      error = interface->phyDriver->init(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Ethernet switch initialization
      error = interface->switchDriver->init(interface);
   }
   else
   {
      //The interface is not properly configured
      error = ERROR_FAILURE;
   }

   //Any error to report?
   if(error)
   {
      return error;
   }

   //Use default MAC configuration
   IP_EMAC->MAC_CONFIGURATION = EMAC_MAC_CONFIGURATION_GPSLCE_MASK |
      EMAC_MAC_CONFIGURATION_PS_MASK | EMAC_MAC_CONFIGURATION_DO_MASK;

   //Set the maximum packet size that can be accepted
   temp = IP_EMAC->MAC_EXT_CONFIGURATION & ~EMAC_MAC_EXT_CONFIGURATION_GPSL_MASK;
   IP_EMAC->MAC_EXT_CONFIGURATION = temp | S32K344_ETH_RX_BUFFER_SIZE;

   //Configure MAC address filtering
   s32k344EthUpdateMacAddrFilter(interface);

   //Disable flow control
   IP_EMAC->MAC_Q0_TX_FLOW_CTRL = 0;
   IP_EMAC->MAC_RX_FLOW_CTRL = 0;

   //Enable the first RX queue
   IP_EMAC->MAC_RXQ_CTRL0 = EMAC_MAC_RXQ_CTRL0_RXQ0EN(2);

   //Configure DMA operating mode
   IP_EMAC->DMA_MODE = EMAC_DMA_MODE_PR(0);
   //Configure system bus mode
   IP_EMAC->DMA_SYSBUS_MODE |= EMAC_DMA_SYSBUS_MODE_AAL_MASK;

   //The DMA takes the descriptor table as contiguous
   IP_EMAC->DMA_CH0_CONTROL = EMAC_DMA_CH0_CONTROL_DSL(0);
   //Configure TX features
   IP_EMAC->DMA_CH0_TX_CONTROL = EMAC_DMA_CH0_TX_CONTROL_TxPBL(32);

   //Configure RX features
   IP_EMAC->DMA_CH0_RX_CONTROL = EMAC_DMA_CH0_RX_CONTROL_RxPBL(32) |
      EMAC_DMA_CH0_RX_CONTROL_RBSZ_13_y(S32K344_ETH_RX_BUFFER_SIZE / 4);

   //Enable store and forward mode for transmission
   IP_EMAC->MTL_TXQ0_OPERATION_MODE |= EMAC_MTL_TXQ0_OPERATION_MODE_TQS(7) |
      EMAC_MTL_TXQ0_OPERATION_MODE_TXQEN(2) | EMAC_MTL_TXQ0_OPERATION_MODE_TSF_MASK;

   //Enable store and forward mode for reception
   IP_EMAC->MTL_RXQ0_OPERATION_MODE |= EMAC_MTL_RXQ0_OPERATION_MODE_RQS(7) |
      EMAC_MTL_RXQ0_OPERATION_MODE_RSF_MASK;

   //Initialize DMA descriptor lists
   s32k344EthInitDmaDesc(interface);

   //Prevent interrupts from being generated when statistic counters reach
   //half their maximum value
   IP_EMAC->MMC_TX_INTERRUPT_MASK = 0xFFFFFFFF;
   IP_EMAC->MMC_RX_INTERRUPT_MASK = 0xFFFFFFFF;
   IP_EMAC->MMC_FPE_TX_INTERRUPT_MASK = 0xFFFFFFFF;
   IP_EMAC->MMC_FPE_RX_INTERRUPT_MASK = 0xFFFFFFFF;

