Oryx-Embedded/CycloneTCP/drivers/mac/s32k344_eth_driver.c
   //Disable MAC interrupts
   IP_EMAC->MAC_INTERRUPT_ENABLE = 0;

   //Enable the desired DMA interrupts
   IP_EMAC->DMA_CH0_INTERRUPT_ENABLE = EMAC_DMA_CH0_INTERRUPT_ENABLE_NIE_MASK |
      EMAC_DMA_CH0_INTERRUPT_ENABLE_RIE_MASK | EMAC_DMA_CH0_INTERRUPT_ENABLE_TIE_MASK;

   //Set priority grouping (3 bits for pre-emption priority, no bits for subpriority)
   NVIC_SetPriorityGrouping(S32K344_ETH_IRQ_PRIORITY_GROUPING);

   //Configure Ethernet interrupt priority
   NVIC_SetPriority(EMAC_0_IRQn, NVIC_EncodePriority(S32K344_ETH_IRQ_PRIORITY_GROUPING,
      S32K344_ETH_IRQ_GROUP_PRIORITY, S32K344_ETH_IRQ_SUB_PRIORITY));

   //Enable MAC transmission and reception
   IP_EMAC->MAC_CONFIGURATION |= EMAC_MAC_CONFIGURATION_TE_MASK |
      EMAC_MAC_CONFIGURATION_RE_MASK;

   //Enable DMA transmission and reception
   IP_EMAC->DMA_CH0_TX_CONTROL |= EMAC_DMA_CH0_TX_CONTROL_ST_MASK;
   IP_EMAC->DMA_CH0_RX_CONTROL |= EMAC_DMA_CH0_RX_CONTROL_SR_MASK;

   //Accept any packets from the upper layer
   osSetEvent(&interface->nicTxEvent);

   //Successful initialization
   return NO_ERROR;
}


/**
 * @brief GPIO configuration
 * @param[in] interface Underlying network interface
 **/

__weak_func void s32k344EthInitGpio(NetInterface *interface)
{
//S32K344MINI-EVB evaluation board?
#if defined(USE_S32K344MINI_EVB)
   //Select RMII interface mode
   IP_DCM_GPR->DCMRWF1 |= DCM_GPR_DCMRWF1_RMII_MII_SEL_MASK;

   //Configure EMAC_MII_RMII_MDIO (PTD16)
   IP_SIUL2->MSCR[112] = SIUL2_MSCR_OBE_MASK | SIUL2_MSCR_IBE_MASK |
      SIUL2_MSCR_PUS_MASK | SIUL2_MSCR_PUE_MASK | SIUL2_MSCR_SSS_2(0) |
      SIUL2_MSCR_SSS_1(1) | SIUL2_MSCR_SSS_0(1);
   IP_SIUL2->IMCR[291] = SIUL2_IMCR_SSS(2);

   //Configure EMAC_MII_RMII_MDC (PTD17)
   IP_SIUL2->MSCR[113] = SIUL2_MSCR_OBE_MASK | SIUL2_MSCR_SSS_2(0) |
      SIUL2_MSCR_SSS_1(1) | SIUL2_MSCR_SSS_0(1);

   //Configure EMAC_MII_RMII_TX_CLK (PTC0)
   IP_SIUL2->MSCR[64] = SIUL2_MSCR_SRC(1) | SIUL2_MSCR_IBE_MASK;
   IP_SIUL2->IMCR[296] = SIUL2_IMCR_SSS(4);

   //Configure EMAC_MII_RMII_TX_EN (PTE9)
   IP_SIUL2->MSCR[137] = SIUL2_MSCR_SRC(1) | SIUL2_MSCR_OBE_MASK |
      SIUL2_MSCR_SSS_2(1) | SIUL2_MSCR_SSS_1(1) | SIUL2_MSCR_SSS_0(0);

   //Configure EMAC_MII_RMII_TXD0 (PTB5)
   IP_SIUL2->MSCR[37] = SIUL2_MSCR_SRC(1) | SIUL2_MSCR_OBE_MASK |
      SIUL2_MSCR_SSS_2(0) | SIUL2_MSCR_SSS_1(0) | SIUL2_MSCR_SSS_0(1);

   //Configure EMAC_MII_RMII_TXD1 (PTB4)
   IP_SIUL2->MSCR[36] = SIUL2_MSCR_SRC(1) | SIUL2_MSCR_OBE_MASK |
      SIUL2_MSCR_SSS_2(0) | SIUL2_MSCR_SSS_1(0) | SIUL2_MSCR_SSS_0(1);

   //Configure EMAC_MII_RMII_RX_DV (PTC15)
   IP_SIUL2->MSCR[79] = SIUL2_MSCR_IBE_MASK;
   IP_SIUL2->IMCR[292] = SIUL2_IMCR_SSS(2);

   //Configure EMAC_MII_RMII_RXD0 (PTD9)
   IP_SIUL2->MSCR[105] = SIUL2_MSCR_IBE_MASK;
   IP_SIUL2->IMCR[294] = SIUL2_IMCR_SSS(3);

   //Configure EMAC_MII_RMII_RXD1 (PTD8)
   IP_SIUL2->MSCR[104] = SIUL2_MSCR_IBE_MASK;
   IP_SIUL2->IMCR[295] = SIUL2_IMCR_SSS(3);

   //Configure ENET_RESET (PTE21) as an output
   IP_SIUL2->MSCR[149] = SIUL2_MSCR_OBE_MASK;

   //Reset PHY transceiver (hard reset)
   IP_SIUL2->GPDO149 = 0;
   sleep(10);
   IP_SIUL2->GPDO149 = 1;
   sleep(100);

   //Configure RMII clocks
   s32k344EthInitRmiiClock();

//S32K3X4EVB-Q172 evaluation board?
#elif defined(USE_S32K3X4EVB_Q172)
   //Select RMII interface mode
   IP_DCM_GPR->DCMRWF1 |= DCM_GPR_DCMRWF1_RMII_MII_SEL_MASK;

   //Configure EMAC_MII_RMII_MDIO (PTD16)
   IP_SIUL2->MSCR[112] = SIUL2_MSCR_OBE_MASK | SIUL2_MSCR_IBE_MASK |
      SIUL2_MSCR_PUS_MASK | SIUL2_MSCR_PUE_MASK | SIUL2_MSCR_SSS_2(0) |
      SIUL2_MSCR_SSS_1(1) | SIUL2_MSCR_SSS_0(1);
   IP_SIUL2->IMCR[291] = SIUL2_IMCR_SSS(2);

   //Configure EMAC_MII_RMII_MDC (PTD17)
   IP_SIUL2->MSCR[113] = SIUL2_MSCR_OBE_MASK | SIUL2_MSCR_SSS_2(0) |
      SIUL2_MSCR_SSS_1(1) | SIUL2_MSCR_SSS_0(1);

   //Configure EMAC_MII_RMII_TX_CLK (PTC0)
   IP_SIUL2->MSCR[64] = SIUL2_MSCR_SRC(1) | SIUL2_MSCR_IBE_MASK;
   IP_SIUL2->IMCR[296] = SIUL2_IMCR_SSS(4);

   //Configure EMAC_MII_RMII_TX_EN (PTE9)
   IP_SIUL2->MSCR[137] = SIUL2_MSCR_SRC(1) | SIUL2_MSCR_OBE_MASK |
      SIUL2_MSCR_SSS_2(1) | SIUL2_MSCR_SSS_1(1) | SIUL2_MSCR_SSS_0(0);

   //Configure EMAC_MII_RMII_TXD0 (PTB5)
   IP_SIUL2->MSCR[37] = SIUL2_MSCR_SRC(1) | SIUL2_MSCR_OBE_MASK |
      SIUL2_MSCR_SSS_2(0) | SIUL2_MSCR_SSS_1(0) | SIUL2_MSCR_SSS_0(1);

   //Configure EMAC_MII_RMII_TXD1 (PTB4)
   IP_SIUL2->MSCR[36] = SIUL2_MSCR_SRC(1) | SIUL2_MSCR_OBE_MASK |
      SIUL2_MSCR_SSS_2(0) | SIUL2_MSCR_SSS_1(0) | SIUL2_MSCR_SSS_0(1);

   //Configure EMAC_MII_RMII_RX_DV (PTC17)
   IP_SIUL2->MSCR[81] = SIUL2_MSCR_IBE_MASK;
   IP_SIUL2->IMCR[292] = SIUL2_IMCR_SSS(1);

   //Configure EMAC_MII_RMII_RXD0 (PTD9)
   IP_SIUL2->MSCR[105] = SIUL2_MSCR_IBE_MASK;
   IP_SIUL2->IMCR[294] = SIUL2_IMCR_SSS(3);

   //Configure EMAC_MII_RMII_RXD1 (PTD8)
   IP_SIUL2->MSCR[104] = SIUL2_MSCR_IBE_MASK;
   IP_SIUL2->IMCR[295] = SIUL2_IMCR_SSS(3);

   //Configure ENET_RESET (PTE21) as an output
   IP_SIUL2->MSCR[149] = SIUL2_MSCR_OBE_MASK;

   //Reset PHY transceiver (hard reset)
   IP_SIUL2->GPDO149 = 0;
   sleep(10);
   IP_SIUL2->GPDO149 = 1;
   sleep(100);

   //Configure RMII clocks
   s32k344EthInitRmiiClock();

//S32K3X4EVB-T172 evaluation board?
#elif defined(USE_S32K3X4EVB_T172)
   //Select RMII interface mode
   IP_DCM_GPR->DCMRWF1 |= DCM_GPR_DCMRWF1_RMII_MII_SEL_MASK;

   //Configure EMAC_MII_RMII_MDIO (PTB4)
   IP_SIUL2->MSCR[36] = SIUL2_MSCR_OBE_MASK | SIUL2_MSCR_IBE_MASK |
      SIUL2_MSCR_PUS_MASK | SIUL2_MSCR_PUE_MASK | SIUL2_MSCR_SSS_2(1) |
      SIUL2_MSCR_SSS_1(0) | SIUL2_MSCR_SSS_0(1);
   IP_SIUL2->IMCR[291] = SIUL2_IMCR_SSS(1);

   //Configure EMAC_MII_RMII_MDC (PTB5)
   IP_SIUL2->MSCR[37] = SIUL2_MSCR_OBE_MASK | SIUL2_MSCR_SSS_2(1) |
      SIUL2_MSCR_SSS_1(1) | SIUL2_MSCR_SSS_0(1);

   //Configure EMAC_MII_RMII_TX_CLK (PTD11)
   IP_SIUL2->MSCR[107] = SIUL2_MSCR_SRC(1) | SIUL2_MSCR_IBE_MASK;
   IP_SIUL2->IMCR[296] = SIUL2_IMCR_SSS(1);

   //Configure EMAC_MII_RMII_TX_EN (PTD12)
   IP_SIUL2->MSCR[108] = SIUL2_MSCR_SRC(1) | SIUL2_MSCR_OBE_MASK |
      SIUL2_MSCR_SSS_2(1) | SIUL2_MSCR_SSS_1(0) | SIUL2_MSCR_SSS_0(1);

   //Configure EMAC_MII_RMII_TXD0 (PTC2)
   IP_SIUL2->MSCR[66] = SIUL2_MSCR_SRC(1) | SIUL2_MSCR_OBE_MASK |
      SIUL2_MSCR_SSS_2(1) | SIUL2_MSCR_SSS_1(0) | SIUL2_MSCR_SSS_0(1);

