Oryx-Embedded/CycloneTCP/drivers/mac/s32k344_eth_driver.c
   //Configure EMAC_MII_RMII_TXD1 (PTD7)
   IP_SIUL2->MSCR[103] = SIUL2_MSCR_SRC(1) | SIUL2_MSCR_OBE_MASK |
      SIUL2_MSCR_SSS_2(1) | SIUL2_MSCR_SSS_1(0) | SIUL2_MSCR_SSS_0(1);

   //Configure EMAC_MII_RMII_RX_DV (PTC17)
   IP_SIUL2->MSCR[81] = SIUL2_MSCR_IBE_MASK;
   IP_SIUL2->IMCR[292] = SIUL2_IMCR_SSS(1);

   //Configure EMAC_MII_RMII_RX_ER (PTC16)
   IP_SIUL2->MSCR[80] = SIUL2_MSCR_IBE_MASK;
   IP_SIUL2->IMCR[293] = SIUL2_IMCR_SSS(1);

   //Configure EMAC_MII_RMII_RXD0 (PTC1)
   IP_SIUL2->MSCR[65] = SIUL2_MSCR_IBE_MASK;
   IP_SIUL2->IMCR[294] = SIUL2_IMCR_SSS(1);

   //Configure EMAC_MII_RMII_RXD1 (PTC0)
   IP_SIUL2->MSCR[64] = SIUL2_MSCR_IBE_MASK;
   IP_SIUL2->IMCR[295] = SIUL2_IMCR_SSS(1);

   //Configure ENET_RSTN (PTA28) as an output
   IP_SIUL2->MSCR[28] = SIUL2_MSCR_OBE_MASK;

   //Reset PHY transceiver (hard reset)
   IP_SIUL2->GPDO28 = 0;
   sleep(10);
   IP_SIUL2->GPDO28 = 1;
   sleep(100);

   //Configure RMII clocks
   s32k344EthInitRmiiClock();

//S32K344-WB evaluation board?
#elif defined(USE_S32K344_WB)
   //Select RMII interface mode
   IP_DCM_GPR->DCMRWF1 |= DCM_GPR_DCMRWF1_RMII_MII_SEL_MASK;

   //Configure EMAC_MII_RMII_MDIO (PTD16)
   IP_SIUL2->MSCR[112] = SIUL2_MSCR_OBE_MASK | SIUL2_MSCR_IBE_MASK |
      SIUL2_MSCR_PUS_MASK | SIUL2_MSCR_PUE_MASK | SIUL2_MSCR_SSS_2(0) |
      SIUL2_MSCR_SSS_1(1) | SIUL2_MSCR_SSS_0(1);
   IP_SIUL2->IMCR[291] = SIUL2_IMCR_SSS(2);

   //Configure EMAC_MII_RMII_MDC (PTE8)
   IP_SIUL2->MSCR[136] = SIUL2_MSCR_OBE_MASK | SIUL2_MSCR_SSS_2(1) |
      SIUL2_MSCR_SSS_1(0) | SIUL2_MSCR_SSS_0(1);

   //Configure EMAC_MII_RMII_TX_CLK (PTD6)
   IP_SIUL2->MSCR[102] = SIUL2_MSCR_SRC(1) | SIUL2_MSCR_IBE_MASK;
   IP_SIUL2->IMCR[296] = SIUL2_IMCR_SSS(2);

   //Configure EMAC_MII_RMII_TX_EN (PTE9)
   IP_SIUL2->MSCR[137] = SIUL2_MSCR_SRC(1) | SIUL2_MSCR_OBE_MASK |
      SIUL2_MSCR_SSS_2(1) | SIUL2_MSCR_SSS_1(1) | SIUL2_MSCR_SSS_0(0);

   //Configure EMAC_MII_RMII_TXD0 (PTB5)
   IP_SIUL2->MSCR[37] = SIUL2_MSCR_SRC(1) | SIUL2_MSCR_OBE_MASK |
      SIUL2_MSCR_SSS_2(0) | SIUL2_MSCR_SSS_1(0) | SIUL2_MSCR_SSS_0(1);

   //Configure EMAC_MII_RMII_TXD1 (PTB4)
   IP_SIUL2->MSCR[36] = SIUL2_MSCR_SRC(1) | SIUL2_MSCR_OBE_MASK |
      SIUL2_MSCR_SSS_2(0) | SIUL2_MSCR_SSS_1(0) | SIUL2_MSCR_SSS_0(1);

   //Configure EMAC_MII_RMII_RX_DV (PTC17)
   IP_SIUL2->MSCR[81] = SIUL2_MSCR_IBE_MASK;
   IP_SIUL2->IMCR[292] = SIUL2_IMCR_SSS(1);

   //Configure EMAC_MII_RMII_RX_ER (PTC16)
   IP_SIUL2->MSCR[80] = SIUL2_MSCR_IBE_MASK;
   IP_SIUL2->IMCR[293] = SIUL2_IMCR_SSS(1);

   //Configure EMAC_MII_RMII_RXD0 (PTC0)
   IP_SIUL2->MSCR[64] = SIUL2_MSCR_IBE_MASK;
   IP_SIUL2->IMCR[294] = SIUL2_IMCR_SSS(2);

   //Configure EMAC_MII_RMII_RXD1 (PTC1)
   IP_SIUL2->MSCR[65] = SIUL2_MSCR_IBE_MASK;
   IP_SIUL2->IMCR[295] = SIUL2_IMCR_SSS(2);

   //Configure RMII clocks
   s32k344EthInitRmiiClock();

//MR-CANHUBK344 evaluation board?
#elif defined(USE_MR_CANHUBK344)
   //Select RMII interface mode
   IP_DCM_GPR->DCMRWF1 |= DCM_GPR_DCMRWF1_RMII_MII_SEL_MASK;

   //Configure EMAC_MII_RMII_MDIO (PTD16)
   IP_SIUL2->MSCR[112] = SIUL2_MSCR_OBE_MASK | SIUL2_MSCR_IBE_MASK |
      SIUL2_MSCR_PUS_MASK | SIUL2_MSCR_PUE_MASK | SIUL2_MSCR_SSS_2(0) |
      SIUL2_MSCR_SSS_1(1) | SIUL2_MSCR_SSS_0(1);
   IP_SIUL2->IMCR[291] = SIUL2_IMCR_SSS(2);

   //Configure EMAC_MII_RMII_MDC (PTE8)
   IP_SIUL2->MSCR[136] = SIUL2_MSCR_OBE_MASK | SIUL2_MSCR_SSS_2(1) |
      SIUL2_MSCR_SSS_1(0) | SIUL2_MSCR_SSS_0(1);

   //Configure EMAC_MII_RMII_TX_CLK (PTD6)
   IP_SIUL2->MSCR[102] = SIUL2_MSCR_SRC(1) | SIUL2_MSCR_IBE_MASK;
   IP_SIUL2->IMCR[296] = SIUL2_IMCR_SSS(2);

   //Configure EMAC_MII_RMII_TX_EN (PTE9)
   IP_SIUL2->MSCR[137] = SIUL2_MSCR_SRC(1) | SIUL2_MSCR_OBE_MASK |
      SIUL2_MSCR_SSS_2(1) | SIUL2_MSCR_SSS_1(1) | SIUL2_MSCR_SSS_0(0);

   //Configure EMAC_MII_RMII_TXD0 (PTB5)
   IP_SIUL2->MSCR[37] = SIUL2_MSCR_SRC(1) | SIUL2_MSCR_OBE_MASK |
      SIUL2_MSCR_SSS_2(0) | SIUL2_MSCR_SSS_1(0) | SIUL2_MSCR_SSS_0(1);

   //Configure EMAC_MII_RMII_TXD1 (PTB4)
   IP_SIUL2->MSCR[36] = SIUL2_MSCR_SRC(1) | SIUL2_MSCR_OBE_MASK |
      SIUL2_MSCR_SSS_2(0) | SIUL2_MSCR_SSS_1(0) | SIUL2_MSCR_SSS_0(1);

   //Configure EMAC_MII_RMII_RX_DV (PTC15)
   IP_SIUL2->MSCR[79] = SIUL2_MSCR_IBE_MASK;
   IP_SIUL2->IMCR[292] = SIUL2_IMCR_SSS(2);

   //Configure EMAC_MII_RMII_RX_ER (PTC14)
   IP_SIUL2->MSCR[78] = SIUL2_MSCR_IBE_MASK;
   IP_SIUL2->IMCR[293] = SIUL2_IMCR_SSS(2);

   //Configure EMAC_MII_RMII_RXD0 (PTC0)
   IP_SIUL2->MSCR[64] = SIUL2_MSCR_IBE_MASK;
   IP_SIUL2->IMCR[294] = SIUL2_IMCR_SSS(2);

   //Configure EMAC_MII_RMII_RXD1 (PTC1)
   IP_SIUL2->MSCR[65] = SIUL2_MSCR_IBE_MASK;
   IP_SIUL2->IMCR[295] = SIUL2_IMCR_SSS(2);

   //Configure ENET_RST_N (PTB22) as an output
   IP_SIUL2->MSCR[54] = SIUL2_MSCR_OBE_MASK;

   //Reset PHY transceiver (hard reset)
   IP_SIUL2->GPDO54 = 0;
   sleep(10);
   IP_SIUL2->GPDO54 = 1;
   sleep(100);

   //Configure RMII clocks
   s32k344EthInitRmiiClock();
#endif
}


/**
 * @brief RMII clock configuration
 **/

void s32k344EthInitRmiiClock(void)
{
   //Configure clock mux 7 (EMAC_TX_CLK)
   while((IP_MC_CGM->MUX_7_CSS & MC_CGM_MUX_7_CSS_SWIP_MASK) != 0)
   {
   }

   //Set 1:2 clock divider for clock mux 7
   IP_MC_CGM->MUX_7_DC_0 = MC_CGM_MUX_7_DC_0_DE_MASK | MC_CGM_MUX_7_DC_0_DIV(1);
   //Wait until the divider configuration update is complete
   while((IP_MC_CGM->MUX_7_DIV_UPD_STAT & MC_CGM_MUX_7_DIV_UPD_STAT_DIV_STAT_MASK) != 0)
   {
   }

   //Select EMAC_RMII_TX_CLK as source clock for clock mux 7
   IP_MC_CGM->MUX_7_CSC = MC_CGM_MUX_7_CSC_SELCTL(24) | MC_CGM_MUX_7_CSC_CLK_SW_MASK;
   //Wait until the CLK_SW bit is set in the status register
   while((IP_MC_CGM->MUX_7_CSS & MC_CGM_MUX_7_CSS_CLK_SW_MASK) == 0)
   {
   }

   //Wait until the clock source switching is complete
   while((IP_MC_CGM->MUX_7_CSS & MC_CGM_MUX_7_CSS_SWIP_MASK) != 0)
   {
   }

   //Configure clock mux 8 (EMAC_RX_CLK)
   while((IP_MC_CGM->MUX_8_CSS & MC_CGM_MUX_8_CSS_SWIP_MASK) != 0)
   {
   }

   //Set 1:2 clock divider for clock mux 8
   IP_MC_CGM->MUX_8_DC_0 = MC_CGM_MUX_8_DC_0_DE_MASK | MC_CGM_MUX_8_DC_0_DIV(1);
   //Wait until the divider configuration update is complete
   while((IP_MC_CGM->MUX_8_DIV_UPD_STAT & MC_CGM_MUX_8_DIV_UPD_STAT_DIV_STAT_MASK) != 0)
   {
   }

   //Select EMAC_RMII_TX_CLK as source clock for clock mux 8
   IP_MC_CGM->MUX_8_CSC = MC_CGM_MUX_8_CSC_SELCTL(24) | MC_CGM_MUX_8_CSC_CLK_SW_MASK;
   //Wait until the CLK_SW bit is set in the status register
   while((IP_MC_CGM->MUX_8_CSS & MC_CGM_MUX_8_CSS_CLK_SW_MASK) == 0)
   {
   }

